In [33]:
import numpy as np
import pandas as pd

## 누락된 데이터 처리

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

|인자|설명|
|:------:|:---|
|dropna|누락된 데이터가 있는 축(low,column)을 제외시킨다. 어느정도의 누락데이터까지 용인할것인지 지정 할 수 있다.|
|fillna|누락된 데이터를 대신할 값을 채우거나 'ffill'이나 'bfill'같은 보간 메서드를 적용한다.|
|isnull|누락되거나 NA인 값을 알려주는 불리언 값이 저장된 같은 형의 객체를 반환|
|notnull|isnull과 반대되는 메서드|

In [8]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [11]:
cleand = data.dropna()
cleand

     0    1    2
0  1.0  6.5  3.0

In [12]:
cleand = data.dropna(how='all') # how='all' : 모두 NAN이면 삭제
cleand

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
# 4번 열을 추가하고 NA 값으로 지정
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
cleand = data.dropna(axis='columns', how='all') # how='all' : 모두 NAN이면 삭제
cleand

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [42]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.877941 -0.413259  1.937725
1 -0.258830 -0.204044 -0.076299
2  0.639332 -1.061624 -0.580669
3  0.243376  1.279737 -0.324014
4 -1.191507 -1.020457  1.021542
5 -0.485849  2.091940 -0.679286
6 -0.011926 -1.074695 -0.336505

In [43]:
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.877941       NaN       NaN
1 -0.258830       NaN       NaN
2  0.639332       NaN -0.580669
3  0.243376       NaN -0.324014
4 -1.191507 -1.020457  1.021542
5 -0.485849  2.091940 -0.679286
6 -0.011926 -1.074695 -0.336505

In [44]:
cleaned = df.dropna()
cleaned

          0         1         2
4 -1.191507 -1.020457  1.021542
5 -0.485849  2.091940 -0.679286
6 -0.011926 -1.074695 -0.336505

In [45]:
cleaned = df.dropna(thresh=2)
cleaned

          0         1         2
2  0.639332       NaN -0.580669
3  0.243376       NaN -0.324014
4 -1.191507 -1.020457  1.021542
5 -0.485849  2.091940 -0.679286
6 -0.011926 -1.074695 -0.336505

In [46]:
df

          0         1         2
0 -0.877941       NaN       NaN
1 -0.258830       NaN       NaN
2  0.639332       NaN -0.580669
3  0.243376       NaN -0.324014
4 -1.191507 -1.020457  1.021542
5 -0.485849  2.091940 -0.679286
6 -0.011926 -1.074695 -0.336505

## 결측치 채우기

In [47]:
filled = df.fillna(0)
filled

          0         1         2
0 -0.877941  0.000000  0.000000
1 -0.258830  0.000000  0.000000
2  0.639332  0.000000 -0.580669
3  0.243376  0.000000 -0.324014
4 -1.191507 -1.020457  1.021542
5 -0.485849  2.091940 -0.679286
6 -0.011926 -1.074695 -0.336505

In [49]:
filled = df.fillna({1:0.9, 2:0})
filled

          0         1         2
0 -0.877941  0.900000  0.000000
1 -0.258830  0.900000  0.000000
2  0.639332  0.900000 -0.580669
3  0.243376  0.900000 -0.324014
4 -1.191507 -1.020457  1.021542
5 -0.485849  2.091940 -0.679286
6 -0.011926 -1.074695 -0.336505

In [50]:
df.fillna(0, inplace=True)
df

          0         1         2
0 -0.877941  0.000000  0.000000
1 -0.258830  0.000000  0.000000
2  0.639332  0.000000 -0.580669
3  0.243376  0.000000 -0.324014
4 -1.191507 -1.020457  1.021542
5 -0.485849  2.091940 -0.679286
6 -0.011926 -1.074695 -0.336505

In [51]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0 -0.480593 -0.571316 -0.468712
1 -0.830702 -0.259143  0.357188
2  0.090747       NaN  0.437814
3  0.912130       NaN  0.523878
4 -0.204677       NaN       NaN
5  0.691836       NaN       NaN

In [52]:
filled = df.fillna(method='ffill')
filled

          0         1         2
0 -0.480593 -0.571316 -0.468712
1 -0.830702 -0.259143  0.357188
2  0.090747 -0.259143  0.437814
3  0.912130 -0.259143  0.523878
4 -0.204677 -0.259143  0.523878
5  0.691836 -0.259143  0.523878

In [53]:
filled = df.fillna(method='ffill', limit = 2)
filled

          0         1         2
0 -0.480593 -0.571316 -0.468712
1 -0.830702 -0.259143  0.357188
2  0.090747 -0.259143  0.437814
3  0.912130 -0.259143  0.523878
4 -0.204677       NaN  0.523878
5  0.691836       NaN  0.523878

## df.fillna(value= , method='ffill', axis=0, inplace= , limit= )
- value : 비어있는 값을 채울 스칼라 값이나 dictionary 형식의 객체
- method : 버간법(기본 ffill)
- axis : 값을 채워 넣을 축(기본 axis=0)
- inplace : 복사본을 생성하지 않고 호출한 객체에 값을 반환(기본값=False)
- limit : 값을 앞 또는 뒤로 몇개까지 채울지 지정

## 데이터 변형
### 데이터 중복 제거

In [58]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [59]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [60]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [62]:
data['v1']=range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [63]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [64]:
data.drop_duplicates(['k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [67]:
data.drop_duplicates(['v1']) # v1은 중복이 없음

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [68]:
data.drop_duplicates(['k1','k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 데이터 변형하기

In [69]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [75]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [73]:
lower_cased = data['food'].str.lower()
lower_cased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [77]:
data['animal'] = lower_cased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [79]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [80]:
data['animal'] = data['food'].map(lambda x: meat_to_animal[x.lower()])
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [82]:
data = pd.Series([1, -999, 2, -999, -1000, 3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [90]:
data2 = data.replace(-999, np.nan)
data2

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [91]:
data2 = data.replace([-999, -1000], np.nan)
data2

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [92]:
data2 = data.replace([-999, -1000], [np.nan, 0])
data2

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [93]:
data2 = data.replace({-999: np.nan, -1000: 0})
data2

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [94]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [95]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [96]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [98]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [99]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [100]:
 data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [101]:
data.rename(index={'OHIO':'INDIANA'}, columns={'three':'peekaboo'}, inplace=True)

In [102]:
data

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [103]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [104]:
# 18~25
# 26~35
# 35~60
# 60이상
bins = [18,25,35,60,100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [105]:
cats.codes # 0~3 까지의 값으로 변경

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [106]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [107]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [108]:
# 왼쪽은 포함 / 오른쪽은 포함안됨
pd.cut(ages, [18,26,36,61,100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [109]:
group_names = ['Youth','YoungAdult','MiddleAged','Senior']

In [113]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [114]:
data = np.random.rand(20)
data

array([0.52976717, 0.91408043, 0.08641675, 0.67318473, 0.52947709,
       0.56801719, 0.84751509, 0.3225364 , 0.85368424, 0.32716365,
       0.64013569, 0.0451534 , 0.19582032, 0.95634698, 0.66966448,
       0.2405446 , 0.21126028, 0.01414683, 0.06570119, 0.4724081 ])

In [115]:
pd.cut(data, 4, precision=2)

[(0.49, 0.72], (0.72, 0.96], (0.013, 0.25], (0.49, 0.72], (0.49, 0.72], ..., (0.013, 0.25], (0.013, 0.25], (0.013, 0.25], (0.013, 0.25], (0.25, 0.49]]
Length: 20
Categories (4, interval[float64]): [(0.013, 0.25] < (0.25, 0.49] < (0.49, 0.72] < (0.72, 0.96]]

In [127]:
data = pd.DataFrame(np.random.randn(1000,4))
data

            0         1         2         3
0    0.263223  0.516555  1.042671 -0.012441
1    1.899512 -0.529295 -0.261148  0.712832
2    0.054007 -2.485555 -2.214113 -0.665838
3   -0.794054  1.695650 -0.622830 -0.187382
4   -0.228874 -1.843499  1.546596 -0.091515
..        ...       ...       ...       ...
995  2.291507  0.030237  0.344594  0.239530
996 -1.016208 -2.152147  0.087838  0.450862
997  0.195412  0.424862 -0.372419  0.597371
998  2.437354  0.994547 -1.173533  2.071166
999 -0.286284 -0.712797 -0.172869 -0.483482

[1000 rows x 4 columns]

In [128]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046112    -0.068664    -0.015816     0.006913
std       1.015999     0.999945     1.002617     1.015077
min      -3.096877    -3.456944    -3.505216    -3.225731
25%      -0.722629    -0.741151    -0.661859    -0.709078
50%      -0.042445    -0.044809    -0.019311    -0.010132
75%       0.650267     0.596400     0.626882     0.713237
max       3.392126     3.085970     3.285131     3.224281

In [130]:
col = data[2]
col[np.abs(col) > 3]

186    3.285131
276   -3.505216
589    3.193958
595    3.087951
625   -3.207937
Name: 2, dtype: float64

In [131]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
5   -0.475132  3.085970 -0.007167  1.841363
53  -0.847784  1.219474  0.270328 -3.036477
102  0.587982 -3.360510 -0.614238  1.911669
133 -0.685344 -0.091465 -0.342851 -3.225731
186  0.757415  0.719135  3.285131 -0.074277
276 -0.504742  0.421152 -3.505216  0.620643
369  3.031149 -0.269683 -0.266644 -1.575495
589  0.589305  0.560631  3.193958  2.711724
595 -0.270942 -0.043531  3.087951 -0.353313
625  0.639413  3.005683 -3.207937  0.387526
798  1.089782 -3.456944  0.395399 -0.913803
855 -0.429789 -3.220883  0.533701  0.906842
857  3.392126 -1.677815 -1.681860  0.429683
867  1.392464 -0.984294 -0.090300  3.224281
893 -3.015576  1.680066  0.410335  0.215719
898 -3.096877 -0.248831 -0.144455  1.467296
911  3.184753 -1.743570  0.294862 -1.314794

In [132]:
data[np.abs(data)>3] = np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046608    -0.067718    -0.015670     0.006951
std       1.013747     0.996412     0.998565     1.013586
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.722629    -0.741151    -0.661859    -0.709078
50%      -0.042445    -0.044809    -0.019311    -0.010132
75%       0.650267     0.596400     0.626882     0.713237
max       3.000000     3.000000     3.000000     3.000000

In [137]:
np.sign(data).head() #부호확인

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0 -1.0 -1.0  1.0
2  1.0 -1.0 -1.0 -1.0
3 -1.0  1.0 -1.0 -1.0
4 -1.0 -1.0  1.0 -1.0

In [136]:
data.head()

          0         1         2         3
0  0.263223  0.516555  1.042671 -0.012441
1  1.899512 -0.529295 -0.261148  0.712832
2  0.054007 -2.485555 -2.214113 -0.665838
3 -0.794054  1.695650 -0.622830 -0.187382
4 -0.228874 -1.843499  1.546596 -0.091515

In [139]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([4, 3, 1, 0, 2])

In [140]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11

In [142]:
df.sample(n=3)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15

In [143]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

3    6
1    7
3    6
3    6
3    6
1    7
2   -1
0    5
1    7
2   -1
dtype: int64

In [144]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [146]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [147]:
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

NameError: name 'dummies' is not defined

In [148]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('movies.dat', sep='::', header=None, names=mnames)
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [149]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [152]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [153]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [154]:
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [156]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1
dummies

,Animation,Children's,Comedy,Adventure,Fantasy,Romance,Drama,Action,Crime,Thriller,Horror,Sci-Fi,Documentary,War,Musical,Mystery,Film-Noir,Western
0,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3879,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3880,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3881,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3882,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [163]:
pd.set_option('display.max_columns',25)
pd.set_option('display.max_row',500)
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.head(3)

,movie_id,title,genres,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Adventure,Genre_Fantasy,Genre_Romance,Genre_Drama,Genre_Action,Genre_Crime,Genre_Thriller,Genre_Horror,Genre_Sci-Fi,Genre_Documentary,Genre_War,Genre_Musical,Genre_Mystery,Genre_Film-Noir,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,1.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0.0,1.0,0.0,1.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men (1995),Comedy|Romance,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [164]:
np.random.seed(12345)
values = np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [166]:
bins = [0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [169]:
val = 'a,b,   guido'
val.split(',')

['a', 'b', '   guido']

In [170]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [171]:
first, second, third = pieces
first+'::'+second+'::'+third

'a::b::guido'

In [172]:
'::'.join(pieces)

'a::b::guido'

In [175]:
'guido' in val
val.index(',')

1

In [176]:
val.find(':')

-1

In [177]:
val.index(':')

ValueError: substring not found

In [178]:
val.count(',')

2

In [179]:
val.replace(',','::')

'a::b::   guido'

In [180]:
val.replace(',','')

'ab   guido'

1. 10살 단위로 인구를 정리한다.
2. 70대 이상은 하나로 합친다.
3. 3개의 기간동안 인구가 증가하는 곳을 찾는다
4. 남성이 여성보다 많이 거주하는 곳 가운데 인구가 3만 이상인 곳을 찾는다. (없으면 없다 표시)

In [264]:
daegu01 = pd.read_csv('daegu\\20180630_2.csv')
daegu02 = pd.read_csv('daegu\\20181231_2.csv')
daegu03 = pd.read_csv('daegu\\2019.06.30.csv', encoding='utf-8')
daegu03

,행정구역,총계,총계 남,총계 여,중구 계,중구 남,중구 여,동구 계,동구 남,동구 여,...,북구 여,수성구 계,수성구 남,수성구 여,달서구 계,달서구 남,달서구 여,달성군 계,달성군 남,달성군 여
0,0세,"13,085","6,754","6,331",456,228,228,"2,019","1,021",998,...,"1,221","1,565",839,726,"2,771","1,413","1,358","2,660","1,358","1,302"
1,1세,"15,384","7,854","7,530",524,273,251,"2,401","1,235","1,166",...,"1,434","1,964",986,978,"3,370","1,780","1,590","2,885","1,429","1,456"
2,2세,"17,580","9,026","8,554",588,293,295,"2,718","1,429","1,289",...,"1,682","2,387","1,217","1,170","3,836","2,028","1,808","3,138","1,579","1,559"
3,3세,"19,659","10,028","9,631",625,325,300,"2,947","1,442","1,505",...,"1,848","2,839","1,501","1,338","4,480","2,313","2,167","3,362","1,701","1,661"
4,4세,"20,230","10,294","9,936",628,297,331,"3,103","1,620","1,483",...,"1,858","3,069","1,536","1,533","4,710","2,388","2,322","3,260","1,641","1,619"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
96,96세,424,91,333,28,7,21,56,12,44,...,69,67,20,47,77,17,60,36,7,29
97,97세,292,62,230,19,2,17,64,11,53,...,32,54,12,42,46,9,37,20,7,13
98,98세,191,31,160,16,2,14,29,10,19,...,30,32,3,29,30,4,26,11,1,10
99,99세,152,26,126,16,7,9,27,6,21,...,23,25,3,22,17,4,13,8,0,8
100,100세 이상,650,153,497,87,16,71,115,29,86,...,59,95,27,68,79,15,64,28,8,20

In [265]:
daegu01['구분'] = pd.DataFrame(np.arange(101))
daegu02['구분'] = pd.DataFrame(np.arange(101))
daegu03['행정구역'] = pd.DataFrame(np.arange(101))
daegu03['행정구역']

0        0
1        1
2        2
3        3
4        4
      ...
96      96
97      97
98      98
99      99
100    100
Name: 행정구역, Length: 101, dtype: int32

In [266]:
bins =[10,20,30,40,50,60,70]
daegu01['grp_digitize']=np.digitize(daegu01['구분'], bins,)
daegu02['grp_digitize']=np.digitize(daegu02['구분'], bins)
daegu03['grp_digitize']=np.digitize(daegu03['행정구역'], bins)
daegu03

,행정구역,총계,총계 남,총계 여,중구 계,중구 남,중구 여,동구 계,동구 남,동구 여,...,수성구 계,수성구 남,수성구 여,달서구 계,달서구 남,달서구 여,달성군 계,달성군 남,달성군 여,grp_digitize
0,0,"13,085","6,754","6,331",456,228,228,"2,019","1,021",998,...,"1,565",839,726,"2,771","1,413","1,358","2,660","1,358","1,302",0
1,1,"15,384","7,854","7,530",524,273,251,"2,401","1,235","1,166",...,"1,964",986,978,"3,370","1,780","1,590","2,885","1,429","1,456",0
2,2,"17,580","9,026","8,554",588,293,295,"2,718","1,429","1,289",...,"2,387","1,217","1,170","3,836","2,028","1,808","3,138","1,579","1,559",0
3,3,"19,659","10,028","9,631",625,325,300,"2,947","1,442","1,505",...,"2,839","1,501","1,338","4,480","2,313","2,167","3,362","1,701","1,661",0
4,4,"20,230","10,294","9,936",628,297,331,"3,103","1,620","1,483",...,"3,069","1,536","1,533","4,710","2,388","2,322","3,260","1,641","1,619",0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
96,96,424,91,333,28,7,21,56,12,44,...,67,20,47,77,17,60,36,7,29,7
97,97,292,62,230,19,2,17,64,11,53,...,54,12,42,46,9,37,20,7,13,7
98,98,191,31,160,16,2,14,29,10,19,...,32,3,29,30,4,26,11,1,10,7
99,99,152,26,126,16,7,9,27,6,21,...,25,3,22,17,4,13,8,0,8,7
100,100,650,153,497,87,16,71,115,29,86,...,95,27,68,79,15,64,28,8,20,7

In [248]:
daegu01_grp = daegu01.groupby('grp_digitize').sum()
daegu02_grp = daegu02.groupby('grp_digitize').sum()
daegu03_grp = daegu03.groupby('grp_digitize').sum()

              행정구역  중구 남  중구 여
grp_digitize
0               45  2855  2717
1              145  2705  2665
2              245  5714  5906
3              345  5836  5475
4              445  5695  5413
5              545  5825  5973
6              645  4649  5420
7             2635  4382  6705

In [211]:
df = daegu03_grp.div(daegu02_grp, fill_value=0)
df

,구분,총계,총계 남,총계 여,중구 계,중구 남,중구 여,동구 계,동구 남,동구 여,...,북구 여,수성구 계,수성구 남,수성구 여,달서구 계,달서구 남,달서구 여,달성군 계,달성군 남,달성군 여
grp_digitize,,,,,,,,,,,,,,,,,,,,,
0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
1,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
2,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
3,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
4,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
5,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
6,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0
7,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,...,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0

In [202]:
daegu01_grp_man = daegu01_grp[daegu01_grp.iloc[:,2] > daegu01_grp.iloc[:,3]]
daegu01_grp_man

,구분,총계,총계 남,총계 여,중구 계,중구 남,중구 여,동구 계,동구 남,동구 여,...,북구 여,수성구 계,수성구 남,수성구 여,달서구 계,달서구 남,달서구 여,달성군 계,달성군 남,달성군 여
grp_digitize,,,,,,,,,,,,,,,,,,,,,
0,45,198201,101712,96489,5674,2952,2722,29075,14987,14088,...,18260,32508,16713,15795,46276,23865,22411,29751,15132,14619
1,145,254854,134152,120702,5549,2801,2748,29903,15815,14088,...,23284,57880,30792,27088,63987,33506,30481,23382,12302,11080
2,245,333016,180686,152330,11300,5611,5689,43608,23707,19901,...,27737,58097,31464,26633,82987,45010,37977,29853,16533,13320
3,345,321372,164102,157270,11396,5877,5519,48971,25221,23750,...,28127,46528,22290,24238,72962,37075,35887,43404,22386,21018

In [203]:
daegu01_grp_man[daegu01_grp_man>30000]

,구분,총계,총계 남,총계 여,중구 계,중구 남,중구 여,동구 계,동구 남,동구 여,...,북구 여,수성구 계,수성구 남,수성구 여,달서구 계,달서구 남,달서구 여,달성군 계,달성군 남,달성군 여
grp_digitize,,,,,,,,,,,,,,,,,,,,,
0,NaN,198201,101712,96489,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,32508,NaN,NaN,46276,NaN,NaN,NaN,NaN,NaN
1,NaN,254854,134152,120702,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,57880,30792.0,NaN,63987,33506.0,30481.0,NaN,NaN,NaN
2,NaN,333016,180686,152330,NaN,NaN,NaN,43608.0,NaN,NaN,...,NaN,58097,31464.0,NaN,82987,45010.0,37977.0,NaN,NaN,NaN
3,NaN,321372,164102,157270,NaN,NaN,NaN,48971.0,NaN,NaN,...,NaN,46528,NaN,NaN,72962,37075.0,35887.0,43404.0,NaN,NaN

In [532]:
import numpy as np
import pandas as pd
daegu01 = pd.read_csv('daegu\\20180630_2.csv')
daegu02 = pd.read_csv('daegu\\20181231_2.csv')
daegu03 = pd.read_csv('daegu\\2019.06.30.csv', thousands=',')

In [533]:
df1=daegu01.copy()
df2=daegu02.copy()
df3=daegu03.copy()
df1

,구분,총계,총계 남,총계 여,중구 계,중구 남,중구 여,동구 계,동구 남,동구 여,...,북구 여,수성구 계,수성구 남,수성구 여,달서구 계,달서구 남,달서구 여,달성군 계,달성군 남,달성군 여
0,0세,14568,7488,7080,511,275,236,2263,1161,1102,...,1356,1784,911,873,3215,1719,1496,2724,1374,1350
1,1세,17475,8947,8528,609,309,300,2755,1410,1345,...,1670,2264,1170,1094,3818,2017,1801,3063,1543,1520
2,2세,19562,9985,9577,612,308,304,3000,1467,1533,...,1847,2684,1410,1274,4423,2317,2106,3327,1668,1659
3,3세,20123,10249,9874,648,315,333,3146,1656,1490,...,1856,2876,1423,1453,4661,2366,2295,3253,1638,1615
4,4세,19794,10069,9725,556,287,269,2971,1519,1452,...,1846,3089,1596,1493,4529,2294,2235,3036,1512,1524
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
96,96세,365,75,290,23,3,20,66,10,56,...,37,73,15,58,64,12,52,31,9,22
97,97세,235,45,190,18,3,15,35,13,22,...,36,43,7,36,39,6,33,16,3,13
98,98세,190,32,158,16,7,9,33,6,27,...,30,29,4,25,25,6,19,15,0,15
99,99세,112,26,86,6,1,5,25,7,18,...,13,17,4,13,19,2,17,8,2,6
100,100세 이상,614,136,478,88,15,73,106,23,83,...,52,97,24,73,68,13,55,26,8,18

In [534]:
drop_list1 = []
check_list1 = ['총계', '구분', ' 남', ' 여'] # 남구 삭제 방지를 위해 '남' 앞에 공백 추가 
for chk in check_list1:
    for item in df1.columns :
        if  chk in item:
            drop_list1.append(item)
drop_list1 = list(set(drop_list1)) #  중복 제거를 위해 set을 사용

In [535]:
df1 = df1.drop(drop_list1, axis=1)
df1

     중구 계  동구 계  서구 계  남구 계  북구 계  수성구 계  달서구 계  달성군 계
0     511  2263   719   586  2766   1784   3215   2724
1     609  2755   887   718  3361   2264   3818   3063
2     612  3000  1010   776  3730   2684   4423   3327
3     648  3146   949   758  3832   2876   4661   3253
4     556  2971  1014   820  3779   3089   4529   3036
..    ...   ...   ...   ...   ...    ...    ...    ...
96     23    66    30    29    49     73     64     31
97     18    35    18    24    42     43     39     16
98     16    33    15    23    34     29     25     15
99      6    25    10    11    16     17     19      8
100    88   106    89    72    68     97     68     26

[101 rows x 8 columns]

In [536]:
drop_list2 = []
check_list2 = ['총계', '구분', ' 남', ' 여'] # 남구 삭제 방지를 위해 '남' 앞에 공백 추가 
for chk in check_list2:
    for item in df2.columns :
        if  chk in item:
            drop_list2.append(item)
drop_list2 = list(set(drop_list2))

In [537]:
df2 = df2.drop(drop_list2, axis=1)
df2

     중구 계  동구 계  서구 계  남구 계  북구 계  수성구 계  달서구 계  달성군 계
0     521  2173   650   587  2688   1685   2954   2735
1     548  2569   784   628  3085   2097   3627   2968
2     656  2875   960   720  3637   2484   4160   3282
3     639  3055   965   779  3827   2858   4623   3264
4     594  3055   937   759  3790   3106   4571   3208
..    ...   ...   ...   ...   ...    ...    ...    ...
96     21    62    22    41    64     64     64     31
97     17    45    25    27    33     54     52     20
98     18    31    13    25    41     25     17      8
99      8    27    10    11    19     24     19     12
100    85   110    95    76    71     90     76     25

[101 rows x 8 columns]

In [538]:
drop_list3 = []
op_list3 = []
check_list3 = ['총계', '행정구역', ' 남', ' 여'] # 남구 삭제 방지를 위해 '남' 앞에 공백 추가 
for chk in check_list3:
    for item in df3.columns :
        if  chk in item:
            drop_list3.append(item)
drop_list3 = list(set(drop_list3))

In [539]:
df3 = df3.drop(drop_list3, axis=1)
df3

     중구 계  동구 계  서구 계  남구 계  북구 계  수성구 계  달서구 계  달성군 계
0     456  2019   559   532  2523   1565   2771   2660
1     524  2401   688   598  2954   1964   3370   2885
2     588  2718   852   675  3386   2387   3836   3138
3     625  2947   947   742  3717   2839   4480   3362
4     628  3103   885   722  3853   3069   4710   3260
..    ...   ...   ...   ...   ...    ...    ...    ...
96     28    56    32    52    76     67     77     36
97     19    64    22    26    41     54     46     20
98     16    29    16    23    34     32     30     11
99     16    27    12    21    26     25     17      8
100    87   115    93    77    76     95     79     28

[101 rows x 8 columns]

In [540]:
df1['인구0'] = (pd.DataFrame(range(0,101))/10).astype(int)*10
df1 = df1.groupby('인구0').sum()
df1['인구'] = df1.index
df1['인구'] = np.where(df1['인구'] >= 70, 70, df1.인구)
df1 = df1.groupby('인구').sum()
df1

     중구 계   동구 계   서구 계   남구 계   북구 계  수성구 계   달서구 계  달성군 계
인구
0    5674  29075   9719   7797  37401  32508   46276  29751
10   5549  29903  14006  11162  48985  57880   63987  23382
20  11300  43608  25542  20608  61021  58097   82987  29853
30  11396  48971  21529  18912  57670  46528   72962  43404
40  11358  54564  27671  22502  77961  79395   98641  40726
50  12107  59064  38473  26615  75014  74095  104487  38816
60  10243  46790  29106  22642  45549  46530   61842  23984
70  10903  39917  22659  21652  36541  40435   43938  17954

In [541]:
df2['인구0'] = (pd.DataFrame(range(0,101))/10).astype(int)*10
df2 = df2.groupby('인구0').sum()
df2['인구'] = df2.index
df2['인구'] = np.where(df2['인구'] >= 70, 70, df2.인구)
df2 = df2.groupby('인구').sum()
df2

     중구 계   동구 계   서구 계   남구 계   북구 계  수성구 계   달서구 계  달성군 계
인구
0    5744  28571   9287   7520  36774  31851   45262  29944
10   5583  29313  13294  10849  48006  56785   62415  23427
20  11670  43532  24698  20423  60735  57599   82364  29824
30  11653  48399  20686  18483  57192  45823   72346  43396
40  11368  53666  26316  21908  76298  77586   96358  40770
50  12107  59146  37819  26357  75980  74581  105563  39590
60  10215  47617  29113  22849  46874  47295   63772  25015
70  11061  41047  23159  22112  37630  41239   45333  18577

In [542]:
df3['인구0'] = (pd.DataFrame(range(0,101))/10).astype(int)*10
df3 = df3.groupby('인구0').sum()
df3['인구'] = df3.index
df3['인구'] = np.where(df3['인구'] >= 70, 70, df3.인구)
df3 = df3.groupby('인구').sum()
df3

     중구 계   동구 계   서구 계   남구 계   북구 계  수성구 계   달서구 계  달성군 계
인구
0    5572  27937   8765   7221  36116  31376   44236  30293
10   5370  28629  12665  10462  46834  55090   60556  23621
20  11620  42833  23711  20327  60691  56987   81862  29765
30  11311  47415  19635  17871  56384  45226   71171  43412
40  11108  52960  25199  21400  75095  76047   94565  41490
50  11798  58640  36882  26010  76729  74962  105716  40356
60  10069  48272  29378  22886  48297  48484   66056  26081
70  11087  42139  23685  22505  38947  42309   47141  19221

In [543]:
df1 = df1.T
df1['총합'] = df1.sum(axis='columns').astype(int)
df1

인구         0     10     20     30     40      50     60     70      총합
중구 계    5674   5549  11300  11396  11358   12107  10243  10903   78530
동구 계   29075  29903  43608  48971  54564   59064  46790  39917  351892
서구 계    9719  14006  25542  21529  27671   38473  29106  22659  188705
남구 계    7797  11162  20608  18912  22502   26615  22642  21652  151890
북구 계   37401  48985  61021  57670  77961   75014  45549  36541  440142
수성구 계  32508  57880  58097  46528  79395   74095  46530  40435  435468
달서구 계  46276  63987  82987  72962  98641  104487  61842  43938  575120
달성군 계  29751  23382  29853  43404  40726   38816  23984  17954  247870

In [544]:
df2 = df2.T
df2['총합'] = df2.sum(axis='columns').astype(int)
df2

인구         0     10     20     30     40      50     60     70      총합
중구 계    5744   5583  11670  11653  11368   12107  10215  11061   79401
동구 계   28571  29313  43532  48399  53666   59146  47617  41047  351291
서구 계    9287  13294  24698  20686  26316   37819  29113  23159  184372
남구 계    7520  10849  20423  18483  21908   26357  22849  22112  150501
북구 계   36774  48006  60735  57192  76298   75980  46874  37630  439489
수성구 계  31851  56785  57599  45823  77586   74581  47295  41239  432759
달서구 계  45262  62415  82364  72346  96358  105563  63772  45333  573413
달성군 계  29944  23427  29824  43396  40770   39590  25015  18577  250543

In [545]:
df3 = df3.T
df3['총합'] = df3.sum(axis='columns').astype(int)
df3

인구         0     10     20     30     40      50     60     70      총합
중구 계    5572   5370  11620  11311  11108   11798  10069  11087   77935
동구 계   27937  28629  42833  47415  52960   58640  48272  42139  348825
서구 계    8765  12665  23711  19635  25199   36882  29378  23685  179920
남구 계    7221  10462  20327  17871  21400   26010  22886  22505  148682
북구 계   36116  46834  60691  56384  75095   76729  48297  38947  439093
수성구 계  31376  55090  56987  45226  76047   74962  48484  42309  430481
달서구 계  44236  60556  81862  71171  94565  105716  66056  47141  571303
달성군 계  30293  23621  29765  43412  41490   40356  26081  19221  254239

In [546]:
pop1 = (df2['총합'] - df1['총합']) > 0
pop2 = (df3['총합'] - df2['총합']) > 0
df3['인구증가'] = pop1 & pop2
df3

인구         0     10     20     30     40      50     60     70      총합   인구증가
중구 계    5572   5370  11620  11311  11108   11798  10069  11087   77935  False
동구 계   27937  28629  42833  47415  52960   58640  48272  42139  348825  False
서구 계    8765  12665  23711  19635  25199   36882  29378  23685  179920  False
남구 계    7221  10462  20327  17871  21400   26010  22886  22505  148682  False
북구 계   36116  46834  60691  56384  75095   76729  48297  38947  439093  False
수성구 계  31376  55090  56987  45226  76047   74962  48484  42309  430481  False
달서구 계  44236  60556  81862  71171  94565  105716  66056  47141  571303  False
달성군 계  30293  23621  29765  43412  41490   40356  26081  19221  254239   True

## 4.
- 남 > 여
- 인구수 > 20만

In [547]:
# 남, 여, 계

In [548]:
df_x=daegu01.copy()
df_y=daegu01.copy()

In [549]:
drop_list_x = []
check_list_x = ['총계', '구분', ' 여', ' 계'] # 남구 삭제 방지를 위해 '남' 앞에 공백 추가 
for chk in check_list_x:
    for item in df_x.columns :
        if  chk in item:
            drop_list_x.append(item)
drop_list_x = list(set(drop_list_x)) #  중복 제거를 위해 set을 사용

In [550]:
df_x = df_x.drop(drop_list_x, axis=1)
df_x

     중구 남  동구 남  서구 남  남구 남  북구 남  수성구 남  달서구 남  달성군 남
0     275  1161   347   291  1410    911   1719   1374
1     309  1410   443   364  1691   1170   2017   1543
2     308  1467   539   393  1883   1410   2317   1668
3     315  1656   497   378  1976   1423   2366   1638
4     287  1519   518   410  1933   1596   2294   1512
..    ...   ...   ...   ...   ...    ...    ...    ...
96      3    10     8     6    12     15     12      9
97      3    13     3     4     6      7      6      3
98      7     6     2     3     4      4      6      0
99      1     7     4     3     3      4      2      2
100    15    23    21    16    16     24     13      8

[101 rows x 8 columns]

In [551]:
df_x['인구0'] = (pd.DataFrame(range(0,101))/10).astype(int)*10
df_x = df_x.groupby('인구0').sum()
df_x['인구'] = df_x.index
df_x['인구'] = np.where(df_x['인구'] >= 70, 70, df_x.인구)
df_x = df_x.groupby('인구').sum()
df_x

    중구 남   동구 남   서구 남   남구 남   북구 남  수성구 남  달서구 남  달성군 남
인구
0   2952  14987   4936   3986  19141  16713  23865  15132
10  2801  15815   7406   5829  25701  30792  33506  12302
20  5611  23707  14240  10837  33284  31464  45010  16533
30  5877  25221  11920   9790  29543  22290  37075  22386
40  5868  28261  14669  11423  38326  36264  47547  21246
50  6000  28461  19174  12691  37412  36270  50800  19554
60  4642  21842  13749  10382  22004  21938  30114  11985
70  4343  16048   9023   8566  14324  16218  17326   7004

In [552]:
drop_list_y = []
check_list_y = ['총계', '구분', ' 남', ' 계'] # 남구 삭제 방지를 위해 '남' 앞에 공백 추가 
for chk in check_list_y:
    for item in df_y.columns :
        if  chk in item:
            drop_list_y.append(item)
drop_list_y = list(set(drop_list_y)) #  중복 제거를 위해 set을 사용

In [553]:
df_y = df_y.drop(drop_list_y, axis=1)
df_y

     중구 여  동구 여  서구 여  남구 여  북구 여  수성구 여  달서구 여  달성군 여
0     236  1102   372   295  1356    873   1496   1350
1     300  1345   444   354  1670   1094   1801   1520
2     304  1533   471   383  1847   1274   2106   1659
3     333  1490   452   380  1856   1453   2295   1615
4     269  1452   496   410  1846   1493   2235   1524
..    ...   ...   ...   ...   ...    ...    ...    ...
96     20    56    22    23    37     58     52     22
97     15    22    15    20    36     36     33     13
98      9    27    13    20    30     25     19     15
99      5    18     6     8    13     13     17      6
100    73    83    68    56    52     73     55     18

[101 rows x 8 columns]

In [554]:
df_y['인구0'] = (pd.DataFrame(range(0,101))/10).astype(int)*10
df_y = df_y.groupby('인구0').sum()
df_y['인구'] = df_y.index
df_y['인구'] = np.where(df_y['인구'] >= 70, 70, df_y.인구)
df_y = df_y.groupby('인구').sum()
df_y

    중구 여   동구 여   서구 여   남구 여   북구 여  수성구 여  달서구 여  달성군 여
인구
0   2722  14088   4783   3811  18260  15795  22411  14619
10  2748  14088   6600   5333  23284  27088  30481  11080
20  5689  19901  11302   9771  27737  26633  37977  13320
30  5519  23750   9609   9122  28127  24238  35887  21018
40  5490  26303  13002  11079  39635  43131  51094  19480
50  6107  30603  19299  13924  37602  37825  53687  19262
60  5601  24948  15357  12260  23545  24592  31728  11999
70  6560  23869  13636  13086  22217  24217  26612  10950

In [555]:
df_x = df_x.T
df_x['총합'] = df_x.sum(axis='columns').astype(int)
df_x

인구         0     10     20     30     40     50     60     70      총합
중구 남    2952   2801   5611   5877   5868   6000   4642   4343   38094
동구 남   14987  15815  23707  25221  28261  28461  21842  16048  174342
서구 남    4936   7406  14240  11920  14669  19174  13749   9023   95117
남구 남    3986   5829  10837   9790  11423  12691  10382   8566   73504
북구 남   19141  25701  33284  29543  38326  37412  22004  14324  219735
수성구 남  16713  30792  31464  22290  36264  36270  21938  16218  211949
달서구 남  23865  33506  45010  37075  47547  50800  30114  17326  285243
달성군 남  15132  12302  16533  22386  21246  19554  11985   7004  126142

In [556]:
df_y = df_y.T
df_y['총합'] = df_y.sum(axis='columns').astype(int)
df_y

인구         0     10     20     30     40     50     60     70      총합
중구 여    2722   2748   5689   5519   5490   6107   5601   6560   40436
동구 여   14088  14088  19901  23750  26303  30603  24948  23869  177550
서구 여    4783   6600  11302   9609  13002  19299  15357  13636   93588
남구 여    3811   5333   9771   9122  11079  13924  12260  13086   78386
북구 여   18260  23284  27737  28127  39635  37602  23545  22217  220407
수성구 여  15795  27088  26633  24238  43131  37825  24592  24217  223519
달서구 여  22411  30481  37977  35887  51094  53687  31728  26612  289877
달성군 여  14619  11080  13320  21018  19480  19262  11999  10950  121728

In [557]:
df_x_2 = df_x.copy()
df_x_2.index = ['a','b','c','d','e','f','g','h']
df_y_2 = df_y.copy()
df_y_2.index = ['a','b','c','d','e','f','g','h']
df_s = df3.copy()
df_s.index = ['a','b','c','d','e','f','g','h']
df_s

인구      0     10     20     30     40      50     60     70      총합   인구증가
a    5572   5370  11620  11311  11108   11798  10069  11087   77935  False
b   27937  28629  42833  47415  52960   58640  48272  42139  348825  False
c    8765  12665  23711  19635  25199   36882  29378  23685  179920  False
d    7221  10462  20327  17871  21400   26010  22886  22505  148682  False
e   36116  46834  60691  56384  75095   76729  48297  38947  439093  False
f   31376  55090  56987  45226  76047   74962  48484  42309  430481  False
g   44236  60556  81862  71171  94565  105716  66056  47141  571303  False
h   30293  23621  29765  43412  41490   40356  26081  19221  254239   True

In [560]:
df_s['남초여부'] = df_x_2['총합'] - df_y_2['총합'] > 0
df_s['20만 이상'] = df_s['총합'] >200000
df_s

인구,0,10,20,30,40,50,60,70,총합,인구증가,남초여부,20만 이상
a,5572,5370,11620,11311,11108,11798,10069,11087,77935,False,False,False
b,27937,28629,42833,47415,52960,58640,48272,42139,348825,False,False,True
c,8765,12665,23711,19635,25199,36882,29378,23685,179920,False,True,False
d,7221,10462,20327,17871,21400,26010,22886,22505,148682,False,False,False
e,36116,46834,60691,56384,75095,76729,48297,38947,439093,False,False,True
f,31376,55090,56987,45226,76047,74962,48484,42309,430481,False,False,True
g,44236,60556,81862,71171,94565,105716,66056,47141,571303,False,False,True
h,30293,23621,29765,43412,41490,40356,26081,19221,254239,True,True,True

In [561]:
df1

인구         0     10     20     30     40      50     60     70      총합
중구 계    5674   5549  11300  11396  11358   12107  10243  10903   78530
동구 계   29075  29903  43608  48971  54564   59064  46790  39917  351892
서구 계    9719  14006  25542  21529  27671   38473  29106  22659  188705
남구 계    7797  11162  20608  18912  22502   26615  22642  21652  151890
북구 계   37401  48985  61021  57670  77961   75014  45549  36541  440142
수성구 계  32508  57880  58097  46528  79395   74095  46530  40435  435468
달서구 계  46276  63987  82987  72962  98641  104487  61842  43938  575120
달성군 계  29751  23382  29853  43404  40726   38816  23984  17954  247870

In [562]:
df_s.index = ['중구 계','동구 계','서구 계','남구 계','북구 계','수성구 계','달서구 계','달성군 계']
df_s

인구,0,10,20,30,40,50,60,70,총합,인구증가,남초여부,20만 이상
중구 계,5572,5370,11620,11311,11108,11798,10069,11087,77935,False,False,False
동구 계,27937,28629,42833,47415,52960,58640,48272,42139,348825,False,False,True
서구 계,8765,12665,23711,19635,25199,36882,29378,23685,179920,False,True,False
남구 계,7221,10462,20327,17871,21400,26010,22886,22505,148682,False,False,False
북구 계,36116,46834,60691,56384,75095,76729,48297,38947,439093,False,False,True
수성구 계,31376,55090,56987,45226,76047,74962,48484,42309,430481,False,False,True
달서구 계,44236,60556,81862,71171,94565,105716,66056,47141,571303,False,False,True
달성군 계,30293,23621,29765,43412,41490,40356,26081,19221,254239,True,True,True

In [563]:
df_s.T

         중구 계    동구 계    서구 계    남구 계    북구 계   수성구 계   달서구 계   달성군 계
인구
0        5572   27937    8765    7221   36116   31376   44236   30293
10       5370   28629   12665   10462   46834   55090   60556   23621
20      11620   42833   23711   20327   60691   56987   81862   29765
30      11311   47415   19635   17871   56384   45226   71171   43412
40      11108   52960   25199   21400   75095   76047   94565   41490
50      11798   58640   36882   26010   76729   74962  105716   40356
60      10069   48272   29378   22886   48297   48484   66056   26081
70      11087   42139   23685   22505   38947   42309   47141   19221
총합      77935  348825  179920  148682  439093  430481  571303  254239
인구증가    False   False   False   False   False   False   False    True
남초여부    False   False    True   False   False   False   False    True
20만 이상  False    True   False   False    True    True    True    True

In [564]:
# ex4_df1_T.columns = ['중구','동구','서구','남구','북구','수성구','달서구','달성군']
# ex4_df1_T

# ex4_df1_T = ex4_df1_T.rename({'중구 계':'대구중구'}, axis='columns')
# ex4_df1_T

# ex4_df1_T.columns = ex4_df1_T.columns.str.replace("구 계","구")
# ex4_df1_T